package com.java.bohomolov.interfaces;

import com.java.bohomolov.exceptions.MissingAccessoryException;

public interface Foldable {

    public void fold() throws MissingAccessoryException;
    public void unfold() throws MissingAccessoryException;

}


//1)різні модифікатори доступу (public, private,..) класів/методів/полів (1 бал) +
//2) присутня інкапсуляція (1 бал) +
//3) присутнє наслідування (1 бал) +
//4) присутній інтерфейс і його імплементація (1 бал) +
//5) присутній поліморфізм (1 бал) +
//6) присутній абстрактний клас (1 бал) +
//7) використовується перераховування константних об’єктів (enum) (1 бал) +
//8) Перевизначити метод toString() для класу enum. Наприклад, виводити всі значення у одну строчку розділяючи комою +
//9) Зібрати строку за допомогою StringBuffer або StringBuilder +
//10) Використати метод String.split(...) для розділення строки за критерієм обраного символу(1 бал) +
//11) Вивести деякі строки на екран консолі із використанням конкатенції строк із іншими типами (1 бал) +
//12) Створити клас-виключення для обробки специфічної для вашої тематики помилки. (1 бал) +
//13) Кидати вами створену помилку та інші за необхідності, обробляти їх у влучному місці за допомогою блоку try-catch-finally (1 бал) +
//14) Використати неперевизначений метод equals або hashCode для порівняння двох об’єктів одного з ваших класів. (1 бал) +
//15) Перевизначити метод equals або hashCode у одному з ваших класів (1 бал) +
//16) наявний вкладений (nested) клас (1 бал) +
//17) присутня асоціація класів (1 бал) +
//18) присутня композиція або агрегація (без урахування nested класу) (1 бал) +
//19) присутня колекція із java.util.Collections (2 бали) +
//